In [11]:
import pandas as pd 
import numpy as np 
import datetime 
import requests
import json 

import plotly.graph_objects as go 
import plotly.express  as px 

from functions import *

In [12]:
start_date = "2016-01-01"
end_date = datetime.date.today()

In [13]:
url="https://seffaflik.epias.com.tr/transparency/service/consumption/real-time-consumption?startDate="+f'{start_date}'+"&endDate="+f'{end_date}'

In [14]:
response = requests.get(url, verify=True)
json_data = json.loads(response.text.encode("utf-8"))
df = pd.DataFrame(json_data["body"]["hourlyConsumptions"]).iloc[:-1]


df["date"] = pd.to_datetime(df.date.str[:16])

In [15]:
df

                     date  consumption
0     2016-01-01 00:00:00     26277.24
1     2016-01-01 01:00:00     24991.82
2     2016-01-01 02:00:00     23532.61
3     2016-01-01 03:00:00     22464.78
4     2016-01-01 04:00:00     22002.91
...                   ...          ...
73287 2024-05-11 15:00:00     39536.79
73288 2024-05-11 16:00:00     38448.12
73289 2024-05-11 17:00:00     37634.56
73290 2024-05-11 18:00:00     36765.50
73291 2024-05-11 19:00:00     35013.56

[73292 rows x 2 columns]

In [18]:
fh_new = 24*7+1
date = pd.date_range(start=df.date.tail(1).iloc[0], periods=fh_new, freq="H", name="date")

date = pd.DataFrame(date)
df_fe = pd.merge(df, date, how="outer")

In [20]:
df_fe

                     date  consumption
0     2016-01-01 00:00:00     26277.24
1     2016-01-01 01:00:00     24991.82
2     2016-01-01 02:00:00     23532.61
3     2016-01-01 03:00:00     22464.78
4     2016-01-01 04:00:00     22002.91
...                   ...          ...
73455 2024-05-18 15:00:00          NaN
73456 2024-05-18 16:00:00          NaN
73457 2024-05-18 17:00:00          NaN
73458 2024-05-18 18:00:00          NaN
73459 2024-05-18 19:00:00          NaN

[73460 rows x 2 columns]